Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/lunyu__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 孔子曰：「天下有道，則禮樂征伐自天子出；天下無道，則禮樂征伐自諸侯出。自諸侯出，蓋十世希不失矣；自大夫出，五世希不失矣；陪臣執國命，三世希不失矣。天下有道，則政不在大夫。天下有道，則庶人不議。」
en: Confucius said, "When good government prevails in the empire, ceremonies, music, and punitive military expeditions proceed from the son of Heaven. When bad government prevails in the empire, ceremonies, music, and punitive military expeditions proceed from the princes. When these things proceed from the princes, as a rule, the cases will be few in which they do not lose their power in ten generations. When they proceed from the Great officers of the princes, as a rule, the cases will be few in which they do not lose their power in five generations. When the subsidiary ministers of the great officers hold in their grasp the orders of the state, as a rule, the cases will be few in which they do not lose their power in three generations. "When right principles prevail in the kingdom, government will not be in the hands of the Great officers. "When right principles prevail in the kingdom, there will be no discussions among the common people."

source: 孔子曰：「祿之去公室，五世矣。政逮於大夫，四世矣。故夫三桓之子孫，微矣。」
en: Confucius said, "The revenue of the state has left the ducal House now for five generations. The government has been in the hands of the Great officers for four generations. On this account, the descendants of the three Hwan are much reduced."

source: 孔子曰：「益者三友，損者三友：友直，友諒，友多聞，益矣；友便辟，友善柔，友便佞，損矣。」
en: Confucius said, "There are three friendships which are advantageous, and three which are injurious. Friendship with the upright; friendship with the sincere; and friendship with the man of much observation:—these are advantageous. Friendship with the man of specious airs; friendship with the insinuatingly soft; and friendship with the glib-tongued:—these are injurious."

source: 孔子曰：「益者三樂，損者三樂：樂節禮樂，樂道人之善，樂多賢友，益矣；樂驕樂，樂佚遊，樂宴樂，損矣。」
en: Confucius said, "There are three things men find enjoyment in which are advantageous, and three things they find enjoyment in which are injurious. To find enjoyment in the discriminating study of ceremonies and music; to find enjoyment in speaking of the goodness of others; to find enjoyment in having many worthy friends:—these are advantageous. To find enjoyment in extravagant pleasures; to find enjoyment in idleness and sauntering; to find enjoyment in the pleasures of feasting:—these are injurious."

source: 孔子曰：「侍於君子有三愆：言未及之而言，謂之躁；言及之而不言，謂之隱；未見顏色而言，謂之瞽。」
en: Confucius said, "There are three errors to which they who stand in the presence of a man of virtue and station are liable. They may speak when it does not come to them to speak;—this is called rashness. They may not speak when it comes to them to speak;—this is called concealment. They may speak without looking at the countenance of their superior;—this is called blindness."

source: 孔子曰：「君子有三戒：少之時，血氣未定，戒之在色；及其壯也，血氣方剛，戒之在鬭；及其老也，血氣既衰，戒之在得。」
en: Confucius said, "There are three things which the superior man guards against. In youth, when the physical powers are not yet settled, he guards against lust. When he is strong and the physical powers are full of vigor, he guards against quarrelsomeness. When he is old, and the animal powers are decayed, he guards against covetousness."

source: 孔子曰：「君子有三畏：畏天命，畏大人，畏聖人之言。小人不知天命而不畏也，狎大人，侮聖人之言。」
en: Confucius said, "There are three things of which the superior man stands in awe. He stands in awe of the ordinances of Heaven. He stands in awe of great men. He stands in awe of the words of sages. "The mean man does not know the ordinances of Heaven, and consequently does not stand in awe of them. He is disrespectful to great men. He makes sport of the words of sages."

source: 孔子曰：「生而知之者，上也；學而知之者，次也；困而學之，又其次也。困而不學，民斯爲下矣！」
en: Confucius said, "Those who are born with the possession of knowledge are the highest class of men. Those who learn, and so, readily, get possession of knowledge, are the next. Those who are dull and stupid, and yet compass the learning, are another class next to these. As to those who are dull and stupid and yet do not learn;—they are the lowest of the people."

source: 孔子曰：「君子有九思：視思明，聽思聰，色思溫，貌思恭，言思忠，事思敬，疑思問，忿思難，見得思義。」
en: Confucius said, "The superior man has nine things which are subjects with him of thoughtful consideration. In regard to the use of his eyes, he is anxious to see clearly. In regard to the use of his ears, he is anxious to hear distinctly. In regard to his countenance, he is anxious that it should be benign. In regard to his demeanor, he is anxious that it should be respectful. In regard to his speech, he is anxious that it should be sincere. In regard to his doing of business, he is anxious that it should be reverently careful. In regard to what he doubts about, he is anxious to question others. When he is angry, he thinks of the difficulties (his anger may involve him in). When he sees gain to be got, he thinks of righteousness."

source: 孔子曰：「『見善如不及，見不善如探湯。』吾見其人矣，吾聞其語矣。『隱居以成其志，行義以達其道。』吾聞其語矣，未見其人也。」
en: Confucius said, "Contemplating good, and pursuing it, as if they could not reach it; contemplating evil, and shrinking from it, as they would from thrusting the hand into boiling water:—I have seen such men, as I have heard such words. "Living in retirement to study their aims, and practising righteousness to carry out their principles:—I have heard these words, but I have not seen such men."

source: （『誠不以富，亦祇以異。』）齊景公有馬千駟，死之日，民無德而稱焉。伯夷叔齊餓於首陽之下，民到于今稱之。其斯之謂與？
en: The duke Ching of Ch'i had a thousand teams, each of four horses, but on the day of his death, the people did not praise him for a single virtue. Po-i and Shu-ch'i died of hunger at the foot of the Shau-yang mountain, and the people, down to the present time, praise them. "Is not that saying illustrated by this?"

source: 陳亢問於伯魚曰：「子亦有異聞乎？」對曰：「未也。嘗獨立，鯉趨而過庭。曰：『學《詩》乎？』對曰：『未也。』『不學《詩》，無以言。』鯉退而學《詩》。他日，又獨立，鯉趨而過庭。曰：『學禮乎？』對曰：『未也。』『不學禮，無以立！』鯉退而學禮。聞斯二者。」陳亢退而喜曰：「問一得三：聞《詩》，聞禮，又聞君子之遠其子也。」
en: Ch'an K'ang asked Po-yu, saying, "Have you heard any lessons from your father different from what we have all heard?" Po-yu replied, "No. He was standing alone once, when I passed below the hall with hasty steps, and said to me, 'Have you learned the Odes?' On my replying 'Not yet,' he added, 'If you do not learn the Odes, you will not be fit to converse with.' I retired and studied the Odes. "Another day, he was in the same way standing alone, when I passed by below the hall with hasty steps, and said to me, "Have you learned the rules of Propriety?" On my replying "Not yet," he added, "If you do not learn the rules of Propriety, your character cannot be established." I then retired, and learned the rules of Propriety. "I have heard only these two things from him." Ch'ang K'ang retired, and, quite delighted, said, "I asked one thing, and I have got three things. I have heard about the Odes. I have heard about the rules of Propriety. I have also heard that the superior man maintains a distant reserve towards his son."

source: 邦君之妻，君稱之曰「夫人」，夫人自稱曰「小童」；邦人稱之曰「君夫人」，稱諸異邦曰「寡小君」；異邦人稱之，亦曰「君夫人」。===注疏本===*《論語註疏》〔魏〕何晏注〔宋〕邢昺疏===校勘記===
en: The wife of the prince of a state is called by him fu zan. She calls herself hsiao t'ung. The people of the State call her chun fu zan, and, to the people of other States, they call her k'wa hsiao chun. The people of other states also call her chun fu zan.

source: 陽貨欲見孔子，孔子不見，歸孔子豚。孔子時其亡也，而往拜之，遇諸塗。謂孔子曰：「來，予與爾言。」曰：「懷其寶而迷其邦，可謂仁乎？」曰：「不可。」「好從事而亟失時，可謂知乎？」曰：「不可。」「日月逝矣，歲不我與。」孔子曰：「諾，吾將仕矣。」
en: Yang Ho wished to see Confucius, but Confucius would not go to see him. On this, he sent a present of a pig to Confucius, who, having chosen a time when Ho was not at home, went to pay his respects for the gift. He met him, however, on the way. Ho said to Confucius, "Come, let me speak with you." He then asked, "Can he be called benevolent who keeps his jewel in his bosom, and leaves his country to confusion?" Confucius replied, "No." "Can he be called wise, who is anxious to be engaged in public employment, and yet is constantly losing the opportunity of being so?" Confucius again said, "No." "The days and months are passing away; the years do not wait for us." Confucius said, "Right; I will go into office."

source: 子曰：「性相近也，習相遠也。」
en: The Master said, "By nature, men are nearly alike; by practice, they get to be wide apart."

source: 子曰：「唯上知與下愚不移也。」
en: The Master said, "There are only the wise of the highest class, and the stupid of the lowest class, who cannot be changed."

source: 子之武城，聞弦歌之聲，夫子莞爾而笑，曰：「割雞焉用牛刀。」子游對曰：「昔者，偃也聞諸夫子曰：『君子學道則愛人，小人學道則易使也。』」子曰：「二三子！偃之言是也，前言戲之耳！」
en: The Master, having come to Wu-ch'ang, heard there the sound of stringed instruments and singing. Well pleased and smiling, he said, "Why use an ox knife to kill a fowl?" Tsze-yu replied, "Formerly, Master, I heard you say,—'When the man of high station is well instructed, he loves men; when the man of low station is well instructed, he is easily ruled.'" The Master said, "My disciples, Yen's words are right. What I said was only in sport."

source: 公山弗擾以費畔，召，子欲往。子路不說，曰：「末之也已，何必公山氏之之也。」子曰：「夫召我者，而豈徒哉？如有用我者，吾其爲東周乎！」
en: Kung-shan Fu-zao, when he was holding Pi, and in an attitude of rebellion, invited the Master to visit him, who was rather inclined to go. Tsze-lu was displeased, and said, "Indeed, you cannot go! Why must you think of going to see Kung-shan?" The Master said, "Can it be without some reason that he has invited me? If any one employ me, may I not make an eastern Chau?"

source: 子張問「仁」於孔子。孔子曰：「能行五者於天下，爲仁矣。」「請問之？」曰：「恭、寬、信、敏、惠。恭則不侮，寬則得眾，信則人任焉，敏則有功，惠則足以使人。」
en: Tsze-chang asked Confucius about perfect virtue. Confucius said, "To be able to practise five things everywhere under heaven constitutes perfect virtue." He begged to ask what they were, and was told, "Gravity, generosity of soul, sincerity, earnestness, and kindness. If you are grave, you will not be treated with disrespect. If you are generous, you will win all. If you are sincere, people will repose trust in you. If you are earnest, you will accomplish much. If you are kind, this will enable you to employ the services of others.

source: 佛肸召，子欲往。子路曰：「昔者由也聞諸夫子曰：『親於其身爲不善者，君子不入也。』佛肸以中牟畔，子之往也，如之何？」子曰：「然，有是言也。不曰堅乎？磨而不磷。不曰白乎？涅而不緇。吾豈匏瓜也哉？焉能繫而不食！」
en: Pi Hsi inviting him to visit him, the Master was inclined to go. Tsze-lu said, "Master, formerly I have heard you say, 'When a man in his own person is guilty of doing evil, a superior man will not associate with him.' Pi Hsi is in rebellion, holding possession of Chung-mau; if you go to him, what shall be said?" The Master said, "Yes, I did use these words. But is it not said, that, if a thing be really hard, it may be ground without being made thin? Is it not said, that, if a thing be really white, it may be steeped in a dark fluid without being made black? "Am I a bitter gourd! How can I be hung up out of the way of being eaten?"

source: 子曰：「由也，女聞『六言六蔽』矣乎？」對曰：「未也。」「居！吾語女。好仁不好學，其蔽也愚；好知不好學，其蔽也蕩；好信不好學，其蔽也賊；好直不好學，其蔽也絞；好勇不好學，其蔽也亂；好剛不好學，其蔽也狂。」
en: The Master said, "Yu, have you heard the six words to which are attached six becloudings?" Yu replied, "I have not." "Sit down, and I will tell them to you. "There is the love of being benevolent without the love of learning;—the beclouding here leads to a foolish simplicity. There is the love of knowing without the love of learning;—the beclouding here leads to dissipation of mind. There is the love of being sincere without the love of learning;—the beclouding here leads to an injurious disregard of consequences. There is the love of straightforwardness without the love of learning;—the beclouding here leads to rudeness. There is the love of boldness without the love of learning;—the beclouding here leads to insubordination. There is the love of firmness without the love of learning;—the beclouding here leads to extravagant conduct."

source: 子曰：「小子！何莫學夫《詩》？《詩》可以興，可以觀，可以群，可以怨；邇之事父，遠之事君；多識於鳥獸草木之名。」
en: The Master said, "My children, why do you not study the Book of Poetry? "The Odes serve to stimulate the mind. "They may be used for purposes of self-contemplation. "They teach the art of sociability. "They show how to regulate feelings of resentment. "From them you learn the more immediate duty of serving one's father, and the remoter one of serving one's prince. "From them we become largely acquainted with the names of birds, beasts, and plants."

source: 子謂伯魚曰：「女爲周南召南矣乎？人而不爲周南召南，其猶正牆面而立也與！」
en: The Master said to Po-yu, "Do you give yourself to the Chau-nan and the Shao-nan. The man who has not studied the Chau-nan and the Shao-nan, is like one who stands with his face right against a wall. Is he not so?"

source: 子曰：「禮云禮云，玉帛云乎哉？樂云樂云！鐘鼓云乎哉？」
en: The Master said, "'It is according to the rules of propriety,' they say.—'It is according to the rules of propriety,' they say. Are gems and silk all that is meant by propriety? 'It is music,' they say.—'It is music,' they say. Are bells and drums all that is meant by music?"

source: 子曰：「色厲而內荏，譬諸小人，其猶穿窬之盜也與？」
en: The Master said, "He who puts on an appearance of stern firmness, while inwardly he is weak, is like one of the small, mean people;—yea, is he not like the thief who breaks through, or climbs over, a wall?"

source: 子曰：「鄉原，德之賊也。」
en: The Master said, "Your good, careful people of the villages are the thieves of virtue."

source: 子曰：「道聽而塗說，德之棄也。」
en: The Master said, "To tell, as we go along, what we have heard on the way, is to cast away our virtue."

source: 子曰：「鄙夫！可與事君也與哉？其未得之也，患得之；既得之，患失之。苟患失之，無所不至矣！」
en: The Master said, "There are those mean creatures! How impossible it is along with them to serve one's prince! "While they have not got their aims, their anxiety is how to get them. When they have got them, their anxiety is lest they should lose them. "When they are anxious lest such things should be lost, there is nothing to which they will not proceed."

source: 子曰：「古者民有三疾，今也或是之亡也。古之狂也肆，今之狂也蕩；古之矜也廉，今之矜也忿戾；古之愚也直，今之愚也詐而已矣。」
en: The Master said, "Anciently, men had three failings, which now perhaps are not to be found. "The high-mindedness of antiquity showed itself in a disregard of small things; the high-mindedness of the present day shows itself in wild license. The stern dignity of antiquity showed itself in grave reserve; the stern dignity of the present day shows itself in quarrelsome perverseness. The stupidity of antiquity showed itself in straightforwardness; the stupidity of the present day shows itself in sheer deceit."

source: 子曰：「惡紫之奪朱也，惡鄭聲之亂雅樂也，惡利口之覆邦家者。」
en: The Master said, "I hate the manner in which purple takes away the luster of vermilion. I hate the way in which the songs of Chang confound the music of the Ya. I hate those who with their sharp mouths overthrow kingdoms and families."

source: 子曰：「予欲無言！」子貢曰：「子如不言，則小子何述焉？」子曰：「天何言哉？四時行焉，百物生焉，天何言哉？」
en: The Master said, "I would prefer not speaking." Tsze-kung said, "If you, Master, do not speak, what shall we, your disciples, have to record?" The Master said, "Does Heaven speak? The four seasons pursue their courses, and all things are continually being produced, but does Heaven say anything?"

source: 孺悲欲見孔子，孔子辭以疾。將命者出戶，取瑟而歌，使之聞之。
en: Zu Pei wished to see Confucius, but Confucius declined, on the ground of being sick, to see him. When the bearer of this message went out at the door, (the Master) took his lute and sang to it, in order that Pei might hear him.

source: 宰我問：「三年之喪，期已久矣！君子三年不爲禮，禮必壞；三年不爲樂，樂必崩。舊穀既沒，新穀既升，鑽燧改火，期可已矣。」子曰：「食夫稻，衣夫錦，於女安乎？」曰：「安！」「女安，則爲之！夫君子之居喪，食旨不甘，聞樂不樂，居處不安，故不爲也。今女安，則爲之！」宰我出。子曰：「予之不仁也！子生三年，然後免於父母之懷。夫三年之喪，天下之通喪也。予也，有三年之愛於其父母乎？」
en: Tsai Wo asked about the three years" mourning for parents, saying that one year was long enough. "If the superior man," said he, "abstains for three years from the observances of propriety, those observances will be quite lost. If for three years he abstains from music, music will be ruined. "Within a year the old grain is exhausted, and the new grain has sprung up, and, in procuring fire by friction, we go through all the changes of wood for that purpose. After a complete year, the mourning may stop." The Master said, "If you were, after a year, to eat good rice, and wear embroidered clothes, would you feel at ease?" "I should," replied Wo. The Master said, "If you can feel at ease, do it. But a superior man, during the whole period of mourning, does not enjoy pleasant food which he may eat, nor derive pleasure from music which he may hear. He also does not feel at ease, if he is comfortably lodged. Therefore he does not do what you propose. But now you feel at ease and may do it." Tsai Wo then went out, and the Master said, "This shows Yu's want of virtue. It is not till a child is three years old that it is allowed to leave the arms of its parents. And the three years" mourning is universally observed throughout the empire. Did Yu enjoy the three years" love of his parents?"

source: 子曰：「飽食終日，無所用心，難矣哉！不有博弈者乎？爲之，猶賢乎已！」
en: The Master said, "Hard is it to deal with him, who will stuff himself with food the whole day, without applying his mind to anything good! Are there not gamesters and chess players? To be one of these would still be better than doing nothing at all."

source: 子路曰：「君子尙勇乎？」子曰：「君子義以爲上。君子有勇而無義爲亂，小人有勇而無義爲盜。」
en: Tsze-lu said, "Does the superior man esteem valour?" The Master said, "The superior man holds righteousness to be of highest importance. A man in a superior situation, having valour without righteousness, will be guilty of insubordination; one of the lower people having valour without righteousness, will commit robbery."

source: 子貢曰：「君子亦有惡乎？」子曰：「有惡，惡稱人之惡者，惡居下流而訕上者，惡勇而無禮者，惡果敢而窒者。」曰：「賜也亦有惡乎？」「惡徼以爲知者，惡不孫以爲勇者，惡訐以爲直者。」
en: Tsze-kung said, "Has the superior man his hatreds also?" The Master said, "He has his hatreds. He hates those who proclaim the evil of others. He hates the man who, being in a low station, slanders his superiors. He hates those who have valour merely, and are unobservant of propriety. He hates those who are forward and determined, and, at the same time, of contracted understanding." The Master then inquired, "Ts'ze, have you also your hatreds?" Tsze-kung replied, "I hate those who pry out matters, and ascribe the knowledge to their wisdom. I hate those who are only not modest, and think that they are valourous. I hate those who make known secrets, and think that they are straightforward."

source: 子曰：「唯女子與小人爲難養也！近之則不孫，遠之則怨。」
en: The Master said, "Of all people, girls and servants are the most difficult to behave to. If you are familiar with them, they lose their humility. If you maintain a reserve towards them, they are discontented."

source: 子曰：「年四十而見惡焉，其終也已。」
en: The Master said, "When a man at forty is the object of dislike, he will always continue what he is."

source: 微子去之，箕子爲之奴，比干諫而死。孔子曰：「殷有三仁焉。」
en: The Viscount of Wei withdrew from the court. The Viscount of Chi became a slave to Chau. Pi-kan remonstrated with him and died. Confucius said, "The Yin dynasty possessed these three men of virtue."

source: 柳下惠爲士師，三黜。人曰：「子未可以去乎？」曰：「直道而事人，焉往而不三黜？枉道而事人，何必去父母之邦？」
en: Hui of Liu-hsia being chief criminal judge, was thrice dismissed from his office. Some one said to him, "Is it not yet time for you, sir, to leave this?" He replied, "Serving men in an upright way, where shall I go to, and not experience such a thrice-repeated dismissal? If I choose to serve men in a crooked way, what necessity is there for me to leave the country of my parents?"

source: 齊景公待孔子，曰：「若季氏則吾不能，以季、孟之閒待之。」曰：「吾老矣，不能用也。」孔子行。
en: The duke Ching of Ch'i, with reference to the manner in which he should treat Confucius, said, "I cannot treat him as I would the chief of the Chi family. I will treat him in a manner between that accorded to the chief of the Chi, and that given to the chief of the Mang family." He also said, "I am old; I cannot use his doctrines." Confucius took his departure.

source: 齊人歸女樂，季桓子受之，三日不朝。孔子行。
en: The people of Ch'i sent to Lu a present of female musicians, which Chi Hwan received, and for three days no court was held. Confucius took his departure.

source: 楚狂接輿，歌而過孔子，曰：「鳳兮！鳳兮！何德之衰？往者不可諫，來者猶可追。已而！已而！今之從政者殆而！」孔子下，欲與之言。趨而辟之，不得與之言。
en: The madman of Ch'u, Chieh-yu, passed by Confucius, singing and saying, "o fang! o fang! How is your virtue degenerated! As to the past, reproof is useless; but the future may still be provided against. Give up your vain pursuit. Give up your vain pursuit. Peril awaits those who now engage in affairs of government." Confucius alighted and wished to converse with him, but Chieh-yu hastened away, so that he could not talk with him.

source: 長沮、桀溺耦而耕。孔子過之，使子路問津焉。長沮曰：「夫執輿者爲誰？」子路曰：「爲孔丘。」曰：「是魯孔丘與？」曰：「是也。」曰：「是知津矣！」問於桀溺，桀溺曰：「子爲誰？」曰：「爲仲由。」曰：「是魯孔丘之徒與？」對曰：「然。」曰：「滔滔者，天下皆是也，而誰以易之？且而與其從辟人之士也，豈若從辟世之士哉？」耰而不輟。子路行以吿，夫子憮然曰：「鳥獸不可與同群！吾非斯人之徒與而誰與？天下有道，丘不與易也。」
en: Ch'ang-tsu and Chieh-ni were at work in the field together, when Confucius passed by them, and sent Tsze-lu to inquire for the ford. Ch'ang-tsu said, "Who is he that holds the reins in the carriage there?" Tsze-lu told him, "It is K'ung Ch'iu." "Is it not K'ung Ch'iu of Lu?" asked he. "Yes," was the reply, to which the other rejoined, "He knows the ford." Tsze-lu then inquired of Chieh-ni, who said to him, "Who are you, sir?" He answered, "I am Chung Yu." "Are you not the disciple of K'ung Ch'iu of Lu?" asked the other. "I am," replied he, and then Chieh-ni said to him, "Disorder, like a swelling flood, spreads over the whole empire, and who is he that will change its state for you? Than follow one who merely withdraws from this one and that one, had you not better follow those who have withdrawn from the world altogether?" With this he fell to covering up the seed, and proceeded with his work, without stopping. Tsze-lu went and reported their remarks, when the Master observed with a sigh, "It is impossible to associate with birds and beasts, as if they were the same with us. If I associate not with these people,—with mankind,—with whom shall I associate? If right principles prevailed through the empire, there would be no use for me to change its state."

source: 子路從而後，遇丈人，以杖荷蓧。子路問曰：「子見夫子乎？」丈人曰：「四體不勤，五穀不分，孰爲夫子？」植其杖而芸。子路拱而立。止子路宿，殺雞爲黍而食之，見其二子焉。明日，子路行以吿。子曰：「隱者也。」使子路反見之。至則行矣。子路曰：「不仕無義。長幼之節，不可廢也；君臣之義，如之何其廢之？欲潔其身，而亂大倫。君子之仕也，行其義也。道之不行，已知之矣。」
en: Tsze-lu, following the Master, happened to fall behind, when he met an old man, carrying across his shoulder on a staff a basket for weeds. Tsze-lu said to him, "Have you seen my master, sir!" The old man replied, "Your four limbs are unaccustomed to toil; you cannot distinguish the five kinds of grain:—who is your master?" With this, he planted his staff in the ground, and proceeded to weed. Tsze-lu joined his hands across his breast, and stood before him. The old man kept Tsze-lu to pass the night in his house, killed a fowl, prepared millet, and feasted him. He also introduced to him his two sons. Next day, Tsze-lu went on his way, and reported his adventure. The Master said, "He is a recluse," and sent Tsze-lu back to see him again, but when he got to the place, the old man was gone. Tsze-lu then said to the family, "Not to take office is not righteous. If the relations between old and young may not be neglected, how is it that he sets aside the duties that should be observed between sovereign and minister? Wishing to maintain his personal purity, he allows that great relation to come to confusion. A superior man takes office, and performs the righteous duties belonging to it. As to the failure of right principles to make progress, he is aware of that."
